{
    "name": "Matt Macdonald",
    "title": "Senior Software Developer",
    "contact": {
        "location": "Seattle, WA",
        "email": "matt.david.macdonald@gmail.com",
        "phone": "(208) 521-8399",
        "websites": {
            "personal": "mattmacdonald.link",
            "linkedIn": "linkedin.com/in/mattmacdonald1989",
            "gitHub": "github.com/MATATAT"
        }
    },
    "experience": [
        {
            "name": "Omni Creator Products",
            "position": "Senior Software Developer",
            "location": "Seattle, WA",
            "startDate": "October 2022",
            "endDate": "",
            "notes": [
                "Led development of backend and web services supporting account management and player onboarding, using Kotlin, React, and Spring Boot.",
                "Built internal tooling (e.g., desktop launcher, distribution pipeline) to support content release and testing workflows for game teams.",
                "Contributed to game platform services for authentication, user and party management, and player communication (e.g., email verification, account notifications).",
                "Built and maintained a Discord-based bot to support early social features and moderation workflows."
            ]
        },
        {
            "name": "Hulu/Disney Streaming",
            "position": "Senior Software Developer",
            "location": "Seattle, WA",
            "startDate": "August 2019",
            "endDate": "October 2022",
            "notes": [
                "Owned front-end development of a first-party interactive ad solution for Hulu device platforms.",
                "Owned design and development of a proprietary UI framework for low-level devices written in Rust.",
                "Led development integrating 3rd-party playback analytics into device platforms.",
                "Analyzed performance on live programming guide and optimized to improve initial render time by 75% (~6 seconds). Response times in navigation were also improved.",
                "Collaborated with UI designers and product managers on improved playback seeking experience and “channel flipping” features.",
                "Gave lectures across the organization on Apple HLS standards, team-scale project planning techniques, pair programming techniques, and mob programming techniques."
            ]
        },
        {
            "name": "iStreamPlanet",
            "position": "Senior Software Developer",
            "location": "Seattle, WA",
            "startDate": "November 2015",
            "endDate": "August 2019",
            "notes": [
                "Gathered requirements, designed, and implemented automated video source routing and monitoring via service interfacing with hardware routers.",
                "Led telemetry and monitoring efforts on core transcoding platform using StatsD, Kafka, and DataDog.",
                "Gathered requirements and developed components responsible for ad and program signaling. Ingested SCTE-35 broadcasting-standard signals and produced output based on user settings.",
                "Designed and implemented logging and debugging pipeline for the above component using AWS services such as Kinesis, Lambda, and ElasticSearch.",
                "Led investigations on time-sensitive software defects and service outages."
            ]
        },
        {
            "name": "Ingeniux Inc.",
            "position": "Software Development Engineer II",
            "location": "Seattle, WA",
            "startDate": "June 2012",
            "endDate": "November 2015",
            "notes": [
                "Developed document search framework on top of Lucene allowing search results to be fine-tuned on a per customer basis. Improved original design to increase speeds up to 66%.",
                "Addressed performance issues with user importing resulting in processing times going from hours to minutes."
            ]
        },
        {
            "name": "Schweitzer Engineering Laboratory",
            "position": "Software Engineering Intern",
            "location": "Pullman, WA",
            "startDate": "May 2010",
            "endDate": "May 2012",
            "notes": [
                "Designed user interface and worked with senior engineers to develop reporting interface for power station equipment."
            ]
        }
    ],
    "qualifications": [
        {
            "title": "Languages",
            "children": ["JavaScript/TypeScript", "HTML5/CSS", "Rust", "Kotlin"]
        },
        {
            "title": "Tools",
            "children": [
                "React",
                "NodeJS",
                "Remix",
                "NestJS",
                "Spring Boot",
                "gRPC",
                "Docker",
                "ElasticSearch",
                "GitHub Actions",
                "AWS",
                "Terraform",
                "Git"
            ]
        },
        {
            "title": "Likes",
            "children": [
                "Collaboration",
                "Functional programming paradigms",
                "Strong typing in code",
                "Optimizing for rapid development"
            ]
        }
    ],
    "education": {
        "name": "Washington State University",
        "position": "B.S. in Computer Science",
        "location": "Pullman, WA",
        "startDate": "2008",
        "endDate": "2011",
        "notes": []
    }
}
