{
    "name": "Matt Macdonald",
    "title": "Senior Software Developer",
    "contact": {
        "location": "Seattle, WA",
        "email": "matt.david.macdonald@gmail.com",
        "phone": "(208) 521-8399",
        "websites": {
            "personal": "mattmacdonald.link",
            "linkedIn": "linkedin.com/in/mattmacdonald1989",
            "gitHub": "github.com/MATATAT"
        }
    },
    "experience": [
        {
            "name": "Omni Creator Products",
            "position": "Senior Software Developer",
            "location": "Seattle, WA",
            "startDate": "October 2022",
            "endDate": "",
            "summary": "Built platform services and tooling to support development and playtesting for multiplayer titles, including an unreleased project and a stealth game in development.",
            "notes": [
                "Led development of backend and web services supporting account management and player onboarding, using Kotlin, Spring Boot, and React.",
                "Designed and implemented distribution infrastructure and desktop launcher in Rust, enabling scalable content delivery and seamless game startup.",
                "Contributed to game platform services for authentication, user and party management, and player communication (e.g., email verification, account notifications).",
                "Supported live playtests with over 500 player engagements across multiple hour-long sessions, validating systems under real usage and informing iteration.",
                "Built and maintained a Discord-based bot to support early social features and moderation workflows."
            ]
        },
        {
            "name": "Hulu/Disney Streaming",
            "position": "Senior Software Developer",
            "location": "Seattle, WA",
            "startDate": "August 2019",
            "endDate": "October 2022",
            "summary": "Led front-end development of interactive ad and playback features across Hulu’s OTT device platforms, with high-scale user reach.",
            "notes": [
                "Led front-end development for interactive ad experiences across Hulu’s device platforms, collaborating closely with product and design teams.",
                "Integrated third-party analytics SDKs across multiple devices, ensuring accurate telemetry for live video playback and user interaction reporting.",
                "Improved rendering and navigation performance in the live programming guide, reducing initial load times by 75% (~6 seconds) and significantly improving responsiveness.",
                "Delivered new playback features including improved seeking and channel-flipping behavior for live and linear TV experiences.",
                "Led internal knowledge-sharing efforts with talks on HLS standards, pair/mob programming practices, and team-scale planning techniques."
            ]
        },
        {
            "name": "iStreamPlanet",
            "position": "Senior Software Developer",
            "location": "Seattle, WA",
            "startDate": "November 2015",
            "endDate": "August 2019",
            "summary": "Developed systems for live broadcast routing, telemetry, and ad signaling used in large-scale video streaming pipelines.",
            "notes": [
                "Designed and implemented automated video source routing and monitoring services in Python, integrating with broadcast control systems and live ingest workflows.",
                "Led observability and telemetry development for a high-volume transcoding platform using Kafka and DataDog, collaborating across a C++ codebase.",
                "Built ad and program signaling components in C#, processing SCTE-35 broadcast signals to support dynamic ad insertion and playout control.",
                "Developed a real-time diagnostics and logging pipeline using AWS Kinesis, Lambda, and ElasticSearch to improve debugging velocity in production.",
                "Investigated and resolved high-priority defects and service outages in time-sensitive, production-critical environments."
            ]
        },
        {
            "name": "Ingeniux Inc.",
            "position": "Software Development Engineer II",
            "location": "Seattle, WA",
            "startDate": "June 2012",
            "endDate": "November 2015",
            "summary": "",
            "notes": [
                "Developed document search framework on top of Lucene allowing search results to be fine-tuned on a per customer basis. Improved original design to increase speeds up to 66%.",
                "Addressed performance issues with user importing resulting in processing times going from hours to minutes."
            ]
        },
        {
            "name": "Schweitzer Engineering Laboratory",
            "position": "Software Engineering Intern",
            "location": "Pullman, WA",
            "startDate": "May 2010",
            "endDate": "May 2012",
            "summary": "",
            "notes": [
                "Designed user interface and worked with senior engineers to develop reporting interface for power station equipment."
            ]
        }
    ],
    "qualifications": [
        {
            "id": "languages",
            "title": "Languages",
            "children": [
                {
                    "category": "strong",
                    "values": ["JavaScript/TypeScript", "Rust"]
                },
                {
                    "category": "proficient",
                    "values": ["Kotlin", "Python"]
                },
                {
                    "category": "exposure",
                    "values": ["Java"]
                }
            ]
        },
        {
            "id": "tools",
            "title": "Tools",
            "children": [
                {
                    "category": "frontend",
                    "values": ["React", "Remix", "HTML5/CSS", "NodeJS", "NestJS"]
                },
                {
                    "category": "backend",
                    "values": ["Spring Boot", "gRPC", "Redis", "SQLite", "DynamoDB"]
                },
                {
                    "category": "infra",
                    "values": ["AWS", "Docker", "Terraform", "GitHub Actions", "SNS/SQS", "ElasticSearch"]
                }
            ]
        },
        {
            "id": "likes",
            "title": "Things I Care About",
            "children": [
                "Developer experience & internal tooling",
                "Strong typing and functional programming",
                "Collaborative product development",
                "Performance tuning and observability"
            ]
        }
    ],
    "education": {
        "name": "Washington State University",
        "position": "B.S. in Computer Science",
        "location": "Pullman, WA",
        "startDate": "2008",
        "endDate": "2011",
        "notes": []
    }
}
